class ZooQuiz:
    points = 0
    questions = [
        {'questions': 'Тебе больше нравиться смотреть на:',
         'answers': {'Лес': 1,
                     'Море': 1,
                     'Небо': 0,
                     'Песок': 0},
         },

        {'questions': 'Ты бы хотел уметь: ',
         'answers': {'Летать по небу': 0,
                     'Бегать быстрее всех': 1,
                     'Плавать очень глубоко': 0,
                     'Лежать и ничего не делать)': 1},
         },

        {'questions': 'Что ты больше всего любишь есть?',
         'answers': {'Рыбку': 0,
                     'Фрукты и овощи': 1,
                     'Вкусное мясо': 1,
                     'Все нравится': 0},
         },

        {'questions': 'Какая твоя любимая пора года?',
         'answers': {'Лето': 1,
                     'Осень': 1,
                     'Зима': 0,
                     'Весна': 0},
        },

        {'questions': 'Где бы тебе хотелось жить?',
         'answers': {'Высоко в горах': 0,
                     'На берегу моря': 1,
                     'В большом городе': 0,
                     'В маленьком городе': 1},
         },

        {'questions': ' Какая из этих черт больше всего тебе подходит?',
         'answers': {'Мечтательный': 1,
                     'Быстрый': 0,
                     'Спокойный': 0,
                     'Вдумчивый': 1},
         },

        {'questions': 'Чего ты больше всего боишься?',
         'answers': {'Летать': 0,
                     'Темноты': 0,
                     'Глубины': 1,
                     'Одиночества': 1},
         },

        {'questions': ' Что для тебя интереснее?',
         'answers': {'Учиться': 1,
                     'Путешествовать': 1,
                     'Проводить время с друзьями': 0,
                     'Играть в компьютер': 0},
         },

        {'questions': 'Какое из этих мест тебя больше всего привлекает?',
         'answers': {'Катакомбы': 0,
                     'Музей': 1,
                     'Кинотеатр': 1,
                     'Дискотека': 0},
         },

        {'questions': 'Что для тебя дом?',
         'answers': {'Место, где я провожу большую часть времени': 0,
                     'Место, где я живу': 1,
                     'Там я могу отдохнуть от проблем и людей': 1,
                     'Место, куда я часто привожу друзей': 0},
         },
    ]

    animals = {
        'Лемур': [0, 'img/lemur.jpeg'],
        'Лисица': [1, 'img/lis.jpg'],
        'Малая панда': [2, 'img/panda.jpeg'],
        'Веслоног денниси': [3, 'img/dennisi.jpeg'],
        'Бегемот': [4, 'img/begem.jpeg'],
        'Дальневосточный леопард': [5, 'img/leopard.jpeg'],
        'Двухцветный кожан': [6,  'img/kojan.jpeg'],
        'Барс': [7,  'img/bars.jpeg'],
        'Сурикат': [8,  'img/surik.jpeg'],
        'Альпака': [9, 'img/alpaca.jpeg'],
    }



