class ZooQuiz:
    points = 0
    questions = [
        {'questions': 'Тебе больше нравиться смотреть на:',
         'answers': {'Лес': 0,
                     'Море': 1,
                     'Небо': 2,
                     'Песок': 3},
         },

        {'questions': 'Ты бы хотел уметь: ',
         'answers': {'Летать по небу': 0,
                     'Бегать быстрее всех': 1,
                     'Плавать очень глубоко': 2,
                     'Лежать и ничего не делать)': 3},
         },

        {'questions': 'Что ты больше всего любишь есть?',
         'answers': {'Рыбку': 0,
                     'Фрукты и овощи': 1,
                     'Вкусное мясо': 2,
                     'Все нравится': 3},
         },

        {'questions': 'Какая твоя любимая пора года?',
         'answers': {'Лето': 0,
                     'Осень': 1,
                     'Зима': 2,
                     'Весна': 3},
        },

        {'questions': 'Где бы тебе хотелось жить?',
         'answers': {'Высоко в горах': 0,
                     'На берегу моря': 1,
                     'В большом городе': 2,
                     'В маленьком городе':3},
         },

        {'questions': ' Какая из этих черт больше всего тебе подходит?',
         'answers': {'Мечтательный': 0,
                     'Быстрый': 1,
                     'Спокойный': 2,
                     'Вдумчивый': 3},
         },

        {'questions': 'Чего ты больше всего боишься?',
         'answers': {'Летать': 0,
                     'Темноты': 1,
                     'Глубины': 2,
                     'Одиночества': 3},
         },

        {'questions': ' Что для тебя интереснее?',
         'answers': {'Учиться': 0,
                     'Путешествовать': 1,
                     'Проводить время с друзьями': 2,
                     'Играть в компьютер': 3},
         },

        {'questions': 'Какое из этих мест тебя больше всего привлекает?',
         'answers': {'Катакомбы': 0,
                     'Музей': 1,
                     'Кинотеатр': 2,
                     'Дискотека': 3},
         },

        {'questions': 'Что для тебя дом?',
         'answers': {'Место, где я провожу большую часть времени': 0,
                     'Место, где я живу': 1,
                     'Там я могу отдохнуть от проблем и людей': 2,
                     'Место, куда я часто привожу друзей': 3},
         },
    ]

    animals = {
        'Гвинейский турако': 0,
        'Азиатский слон': 1,
        'Белая сова': 2,
        'Балийский скворец': 3,
        'Веслоног денниси': 4,
        'Викунья': 5,
        'Дальневосточный леопард': 6,
        'Двухцветный кожан': 7,
        'Ирбис, снежный барс': 8,
        'Кряква': 9,
        'Ларга': 10
    }



