class ZooQuiz:
    questions = [
        {'questions': 'Тебе больше нравиться смотреть на:',
         'answers': ['Лес', 'Море', 'Небо', 'Песок'],
         'points': [0, 1, 2, 3]},

        {'questions': 'Ты бы хотели уметь: ',
         'answers': ['Летать по небу', 'Бегать быстрее всех', 'Плавать очень глубоко', 'Лежать и ничего не делать)'],
         'points': [0, 1, 2, 3]},

        {'questions': 'Что ты больше всего любишь есть?',
         'answers': ['Рыбку', 'Фрукты и овощи', 'Вкусное мясо', 'Все нравится'],
         'points': [0, 1, 2, 3]},

        {'questions': 'Какая твоя любимая пора года?',
         'answers': ['Лето', 'Осень', 'Зима', 'Весна'],
         'points': [0, 1, 2, 3]},

        {'questions': 'Где бы тебе хотелось жить?',
         'answers': ['Высоко в горах', 'На берегу моря', 'В большом городе', 'В малеьком городе'],
         'points': [0, 1, 2, 3]},

        {'questions': ' Какая из этих черт больше всего тебе подходит?',
         'answers': ['Мечтательный', 'Быстрый', 'Спокойный', 'Вдумчивый'],
         'points': [0, 1, 2, 3]},

        {'questions': 'Чего ты больше всего боишься?',
         'answers': ['Летать', 'Темноты', 'Глубины', 'Одиночества'],
         'points': [0, 1, 2, 3]},

        {'questions': ' Что для тебя интереснее?',
         'answers': ['Учиться', 'Путешествовать', 'Проводить время с друзьями', 'Играть в компьютер'],
         'points': [0, 1, 2, 3]},

        {'questions': 'Какое из этих мест тебя больше всего привлекает?',
         'answers': ['Катакомбы', 'Музей', 'Кинотеатр', 'Дискотека'],
         'points': [0, 1, 2, 3]},

        {'questions': 'Что для тебя дом?',
         'answers': ['Место, где я провожу большую часть времени', 'Место, где я живу', 'Там я могу отдохнуть от '
                                                                                        'проблем и людей',
                     'Место, куда я часто привожу друзей'],
         'points': [0, 1, 2, 3]},
    ]

    animals = {
        'Гвинейский турако': 0,
        'Азиатский слон': 1,
        'Белая сова': 2,
        'Балийский скворец': 3,
        'Веслоног денниси': 4,
        'Викунья': 5,
        'Дальневосточный леопард': 6,
        'Двухцветный кожан': 7,
        'Ирбис, снежный барс': 8,
        'Кряква': 9,
        'Ларга': 10
    }


